package com.gruppa.books.data.db

import com.gruppa.books.models.Book

object Books {
    val testBooks: List<Book> = listOf(
        Book(
            id = 0,
            name = "Письма к брату Тео",
            imageUrl = "https://cdn.ast.ru/v2/ASE000000000833774/COVER/cover1__w600.jpg",
            author = "Ван Гог Винсент",
            editionYear = 2004,
            description = "Винсент Ван Гог – великий нидерландский художник-постимпрессионист, оказавший огромное влияние на живопись ХХ века. За свою короткую жизнь Ван Гог создал более двух тысяч произведений – портреты, автопортреты, пейзажи, натюрморты, панно. Его судьба полна загадок, а творчество не одно десятилетие занимает умы людей – исследователей, художников и ценителей искусства.",
            mark = 5f,
            price = 240,
        ),
        Book(
            id = 0,
            name = "Письма к брату Тео 1",
            imageUrl = "https://cdn.ast.ru/v2/ASE000000000833774/COVER/cover1__w600.jpg",
            author = "Ван Гог Винсент",
            editionYear = 2004,
            description = "Винсент Ван Гог – великий нидерландский художник-постимпрессионист, оказавший огромное влияние на живопись ХХ века. За свою короткую жизнь Ван Гог создал более двух тысяч произведений – портреты, автопортреты, пейзажи, натюрморты, панно. Его судьба полна загадок, а творчество не одно десятилетие занимает умы людей – исследователей, художников и ценителей искусства.",
            mark = 5f,
            price = 240,
        ),
        Book(
            id = 0,
            name = "Письма к брату Тео 11",
            imageUrl = "https://cdn.ast.ru/v2/ASE000000000833774/COVER/cover1__w600.jpg",
            author = "Ван Гог Винсент",
            editionYear = 2004,
            description = "Винсент Ван Гог – великий нидерландский художник-постимпрессионист, оказавший огромное влияние на живопись ХХ века. За свою короткую жизнь Ван Гог создал более двух тысяч произведений – портреты, автопортреты, пейзажи, натюрморты, панно. Его судьба полна загадок, а творчество не одно десятилетие занимает умы людей – исследователей, художников и ценителей искусства.",
            mark = 5f,
            price = 240,
        ), Book(
            id = 0,
            name = "Письма к брату Тео 111",
            imageUrl = "https://cdn.ast.ru/v2/ASE000000000833774/COVER/cover1__w600.jpg",
            author = "Ван Гог Винсент",
            editionYear = 2004,
            description = "Винсент Ван Гог – великий нидерландский художник-постимпрессионист, оказавший огромное влияние на живопись ХХ века. За свою короткую жизнь Ван Гог создал более двух тысяч произведений – портреты, автопортреты, пейзажи, натюрморты, панно. Его судьба полна загадок, а творчество не одно десятилетие занимает умы людей – исследователей, художников и ценителей искусства.",
            mark = 5f,
            price = 240,
        ),
        Book(
            id = 0,
            name = "Письма к брату Тео 2",
            imageUrl = "https://cdn.ast.ru/v2/ASE000000000833774/COVER/cover1__w600.jpg",
            author = "Ван Гог Винсент",
            editionYear = 2004,
            description = "Винсент Ван Гог – великий нидерландский художник-постимпрессионист, оказавший огромное влияние на живопись ХХ века. За свою короткую жизнь Ван Гог создал более двух тысяч произведений – портреты, автопортреты, пейзажи, натюрморты, панно. Его судьба полна загадок, а творчество не одно десятилетие занимает умы людей – исследователей, художников и ценителей искусства.",
            mark = 5f,
            price = 240,
        ), Book(
            id = 0,
            name = "Письма к брату Тео 22",
            imageUrl = "https://cdn.ast.ru/v2/ASE000000000833774/COVER/cover1__w600.jpg",
            author = "Ван Гог Винсент",
            editionYear = 2004,
            description = "Винсент Ван Гог – великий нидерландский художник-постимпрессионист, оказавший огромное влияние на живопись ХХ века. За свою короткую жизнь Ван Гог создал более двух тысяч произведений – портреты, автопортреты, пейзажи, натюрморты, панно. Его судьба полна загадок, а творчество не одно десятилетие занимает умы людей – исследователей, художников и ценителей искусства.",
            mark = 5f,
            price = 240,
        ), Book(
            id = 0,
            name = "Письма к брату Тео 222",
            imageUrl = "https://cdn.ast.ru/v2/ASE000000000833774/COVER/cover1__w600.jpg",
            author = "Ван Гог Винсент",
            editionYear = 2004,
            description = "Винсент Ван Гог – великий нидерландский художник-постимпрессионист, оказавший огромное влияние на живопись ХХ века. За свою короткую жизнь Ван Гог создал более двух тысяч произведений – портреты, автопортреты, пейзажи, натюрморты, панно. Его судьба полна загадок, а творчество не одно десятилетие занимает умы людей – исследователей, художников и ценителей искусства.",
            mark = 5f,
            price = 240,
        ), Book(
            id = 0,
            name = "Письма к брату Тео",
            imageUrl = "https://cdn.ast.ru/v2/ASE000000000833774/COVER/cover1__w600.jpg",
            author = "Ван Гог Винсент",
            editionYear = 2004,
            description = "Винсент Ван Гог – великий нидерландский художник-постимпрессионист, оказавший огромное влияние на живопись ХХ века. За свою короткую жизнь Ван Гог создал более двух тысяч произведений – портреты, автопортреты, пейзажи, натюрморты, панно. Его судьба полна загадок, а творчество не одно десятилетие занимает умы людей – исследователей, художников и ценителей искусства.",
            mark = 5f,
            price = 240,
        ), Book(
            id = 0,
            name = "Письма к брату Тео",
            imageUrl = "https://cdn.ast.ru/v2/ASE000000000833774/COVER/cover1__w600.jpg",
            author = "Ван Гог Винсент",
            editionYear = 2004,
            description = "Винсент Ван Гог – великий нидерландский художник-постимпрессионист, оказавший огромное влияние на живопись ХХ века. За свою короткую жизнь Ван Гог создал более двух тысяч произведений – портреты, автопортреты, пейзажи, натюрморты, панно. Его судьба полна загадок, а творчество не одно десятилетие занимает умы людей – исследователей, художников и ценителей искусства.",
            mark = 5f,
            price = 240,
        )
    )
}